// Calculator.jsx - Добавить операции: степень, округление, минимальное/максимальное значение.
export const Calculator = () => {
  const a = 15;
  const b = 7;
  
  return (
    <div>
      <h2>Калькулятор</h2>
      <p>{a} + {b} = {a + b}</p>
      <p>{a} * {b} = {a * b}</p>
      <p>Среднее: {(a + b) / 2}</p>
      <p>Остаток от деления: {a % b}</p>
      <p>Случайное число: {Math.random()}</p>
      <p>Степень a: {(a) ** 2}</p>
      <p>Степень b: {(b) ** 2}</p>
      <p>Округление a: {Math.round(a)}</p>
      <p>Округление b: {Math.round(b)}</p>
      <p>Минимальное значение (b): {Math.min(a, b)}</p>
      <p>Максимальное значение (a): {Math.max(a, b)}</p>
    </div>
  );
};